app/Controllers/Owner/DashboardControl.php

    public function index()
    {
        $db = \Config\Database::connect();

        // 1. Total Produk: Menghitung semua baris di tabel 'products'
        $totalProduk = $db->table('products')->countAllResults();

        // 2. Total Penjualan Per Bulan: Menggunakan field 'total_amount' dari tabel 'sales'
        $totalPenjualanBulan = $db->table('sales')
            ->where('MONTH(sales_date)', date('m'))
            ->where('YEAR(sales_date)', date('Y'))
            ->selectSum('total_amount')
            ->get()->getRow()->total_amount;

        // Menentukan rentang waktu minggu ini
        $startOfWeek = date('Y-m-d 00:00:00', strtotime('monday this week'));
        $endOfWeek   = date('Y-m-d 23:59:59', strtotime('sunday this week'));

        // 3. Total Keuntungan Per Minggu: (price - purchase_price) * quantity
        $keuntunganMinggu = $db->table('sales_detail') // Tabel detail transaksi
            ->join('sales', 'sales.sales_id = sales_detail.sales_id')
            ->join('products', 'products.product_id = sales_detail.product_id')
            ->where('sales.sales_date >=', $startOfWeek)
            ->where('sales.sales_date <=', $endOfWeek)
            // Rumus profit: harga jual di detail dikurangi harga beli di master produk
            ->select('SUM((sales_detail.price - products.purchase_price) * sales_detail.quantity) as profit')
            ->get()->getRow()->profit;

        // 4. Total Pengeluaran Per Minggu: Dari tabel 'purchase' (pembelian stok)
        $pengeluaranMinggu = $db->table('purchase')
            ->where('purchase_date >=', $startOfWeek)
            ->where('purchase_date <=', $endOfWeek)
            ->selectSum('total_amount') // Field total dari pembelian
            ->get()->getRow()->total_amount;
---
SELECT COUNT(*) AS `numrows`
FROM `products`
SELECT SUM(`total_amount`) AS `total_amount`
FROM `sales`
WHERE MONTH(sales_date) = '07'
AND YEAR(sales_date) = '2026'
SELECT SUM((sales_detail.price - products.purchase_price) * sales_detail.quantity) as profit
FROM `sales_detail`
JOIN `sales` ON `sales`.`sales_id` = `sales_detail`.`sales_id`
JOIN `products` ON `products`.`product_id` = `sales_detail`.`product_id`
WHERE `sales`.`sales_date` >= '2026-07-20 00:00:00'
AND `sales`.`sales_date` <= '2026-07-26 23:59:59'
SELECT SUM(`total_amount`) AS `total_amount`
FROM `purchase`
WHERE `purchase_date` >= '2026-07-20 00:00:00'
AND `purchase_date` <= '2026-07-26 23:59:59'