app/Controllers/Owner/KategoriControl.php

    public function index()
    {
        $data = [
            'title'=>'Kategori | Owner',
            'judul'=>'Master Data',
            'subjudul'=>'Kategori',
            'menu'=>'masterdata',
            'submenu'=>'kategori'
        ];
        $data['kategori'] = $this->CategoriesModel->findAll();
---
SELECT *
FROM `categories`