app/Controllers/Owner/PembelianControl.php

      public function index()
      {
        $dataPurchase = $this->PurchaseModel
            ->select('purchase.*, users.user_name')
            ->join('users', 'users.user_id = purchase.user_id')
            ->orderBy('purchase.purchase_date', 'DESC') // Lebih disarankan untuk laporan
            ->findAll();
---
SELECT `purchase`.*, `users`.`user_name`
FROM `purchase`
JOIN `users` ON `users`.`user_id` = `purchase`.`user_id`
ORDER BY `purchase`.`purchase_date` DESC

      public function detail($purchase_id)
      {
        // Melakukan double join dari PurchaseDetailModel
        $detailPembelian = $this->PurchaseDetailModel
          ->select('purchase_detail.*, products.product_name, purchase.purchase_date')
          ->join('products', 'products.product_id = purchase_detail.product_id', 'left')
          ->join('purchase', 'purchase.purchase_id = purchase_detail.purchase_id', 'left')
          ->where('purchase_detail.purchase_id', $purchase_id)
          ->findAll();
---
SELECT `purchase_detail`.*, `products`.`product_name`, `purchase`.`purchase_date`
FROM `purchase_detail`
LEFT JOIN `products` ON `products`.`product_id` = `purchase_detail`.`product_id`
LEFT JOIN `purchase` ON `purchase`.`purchase_id` = `purchase_detail`.`purchase_id`
WHERE `purchase_detail`.`purchase_id` = '4'