app/Controllers/Owner/PenjualanControl.php

SELECT `sales`.*, `users`.`user_name`
FROM `sales`
JOIN `users` ON `users`.`user_id` = `sales`.`user_id`
ORDER BY `sales`.`sales_date` DESC
---
    public function index()
    {
      $dataSales = $this->SalesModel
        ->select('sales.*, users.user_name')
        ->join('users', 'users.user_id = sales.user_id')
        ->orderBy('sales.sales_date', 'DESC')
        ->findAll();