app/Controllers/Owner/ProdukControl.php

    public function index()
    {
        $data = [
            'title'    => 'Users | Owner',
            'judul'    => 'Master Data',
            'subjudul' => 'Produk',
            'menu'     => 'masterdata',
            'submenu'  => 'produk'
        ];

        $data['produk']   = $this->ProductModel->getAll();
        $data['satuan']   = $this->UnitsModel->findAll();
        $data['kategori'] = $this->CategoriesModel->findAll();
---
SELECT *
FROM `units`
SELECT *
FROM `categories`