app/Controllers/Owner/SatuanControl.php

SELECT *
FROM `units`
---
    public function index()
    {
        $data = [
            'title'=>'Satuan | Owner',
            'judul'=>'Master Data',
            'subjudul'=>'Satuan',
            'menu'=>'masterdata',
            'submenu'=>'satuan'
        ];
        $data['satuan'] = $this->UnitsModel->findAll();