app/Controllers/Owner/UsersControl.php

    public function index()
    {
        $data = [
            'title'=>'Users | Owner',
            'judul'=>'Users',
            'subjudul'=>'',
            'menu'=>'users',
            'submenu'=>''
        ];
        $data['users'] = $this->UsersModel->getAll();
        $data['roles'] = $this->RolesModel->findAll();
---
SELECT *
FROM `roles`

    public function get($user_id = null)
    {
        $data = $this->UsersModel->find($user_id);
---
SELECT *
FROM `users`
WHERE `users`.`user_id` = '1'