app/Controllers/Auth/Auth.php

SELECT *
FROM `users`
WHERE `user_email` = 'owner@gmail.com'
 LIMIT 1
SELECT *
FROM `users`
JOIN `roles` ON `roles`.`roles_id` = `users`.`roles_id`
WHERE `users`.`user_id` = '1'
---
        public function loginProcess() {
        $model = new UsersModel();
        // PERBAIKAN TYPO:
        $email = $this->request->getPost('user_email');
        $pass  = $this->request->getPost('password_hash');
        $user = $model->where('user_email', $email)->first();

        if ($user && password_verify($pass, $user['password_hash'])) {
            if ($user['is_active'] != 1) {
                return redirect()->back()->with('error', 'Akun tidak aktif!');
            }

            // Ambil data user lengkap (termasuk join role dari model)
            // Kita cari data spesifik user ini saja agar efisien
            $db = \Config\Database::connect();
            $userData = $db->table('users')
                        ->join('roles', 'roles.roles_id = users.roles_id')
                        ->where('users.user_id', $user['user_id'])
                        ->get()->getRowArray();