app/Models/LaporanModel.php

SELECT `sales`.`sales_date`, `products`.`product_id` as `kode_barang`, `products`.`product_name` as `nama_produk`, `sales_detail`.`price` as `harga_jual`, `sales_detail`.`current_capital` as `harga_beli`, `sales_detail`.`quantity` as `qty`
FROM `sales_detail`
JOIN `sales` ON `sales`.`sales_id` = `sales_detail`.`sales_id`
JOIN `products` ON `products`.`product_id` = `sales_detail`.`product_id`
WHERE DATE(sales.sales_date) = '2026-07-21'
---
    public function DataHarian($tgl)
{
    return $this->db->table('sales_detail')
        ->select('
            sales.sales_date,
            products.product_id as kode_barang,
            products.product_name as nama_produk,
            sales_detail.price as harga_jual,

            sales_detail.current_capital as harga_beli,

            sales_detail.quantity as qty
        ')
        ->join('sales', 'sales.sales_id = sales_detail.sales_id')
        ->join('products', 'products.product_id = sales_detail.product_id')
        ->where('DATE(sales.sales_date)', $tgl)
        ->get()
        ->getResultArray();

SELECT `products`.`product_id`, `products`.`product_name`, SUM(sales_detail.quantity) as total_qty, SUM(sales_detail.subtotal) as total_omzet_produk, -- laba kotor per produk
            SUM((sales_detail.price - sales_detail.current_capital) * sales_detail.quantity) as laba_produk
FROM `sales`
JOIN `sales_detail` ON `sales_detail`.`sales_id` = `sales`.`sales_id`
JOIN `products` ON `products`.`product_id` = `sales_detail`.`product_id`
WHERE YEAR(sales.sales_date) = '2026'
AND MONTH(sales.sales_date) = '07'
GROUP BY `products`.`product_id`
SELECT SUM(`total_amount`) AS `total_belanja`
FROM `purchase`
WHERE YEAR(purchase_date) = '2026'
AND MONTH(purchase_date) = '07'
---
  public function DataBulanan($tahun, $bulan)
{
    // 1. Ambil rincian produk + Laba Kotor per produk (Harga Jual - Modal)
    $penjualan = $this->db->table('sales')
        ->select('
            products.product_id,
            products.product_name,
            SUM(sales_detail.quantity) as total_qty,
            SUM(sales_detail.subtotal) as total_omzet_produk,

            -- laba kotor per produk
            SUM((sales_detail.price - sales_detail.current_capital) * sales_detail.quantity) as laba_produk
        ')
        ->join('sales_detail', 'sales_detail.sales_id = sales.sales_id')
        ->join('products', 'products.product_id = sales_detail.product_id')
        ->where('YEAR(sales.sales_date)', $tahun)
        ->where('MONTH(sales.sales_date)', $bulan)
        ->groupBy('products.product_id')
        ->get()->getResultArray();

    // 2. Ambil Total Belanja Stok (Modal Awal) dari tabel purchase
    $modal = $this->db->table('purchase')
        ->selectSum('total_amount', 'total_belanja')
        ->where('YEAR(purchase_date)', $tahun)
        ->where('MONTH(purchase_date)', $bulan)
        ->get()->getRowArray();