app/Models/ProductModel.php

SELECT *
FROM `products`
JOIN `categories` ON `categories`.`category_id` = `products`.`category_id`
JOIN `units` ON `units`.`unit_id` = `products`.`unit_id`
---
  public function baseQuery()
  {
    return $this->db->table('products')
      ->join('categories','categories.category_id = products.category_id')
      ->join('units','units.unit_id = products.unit_id');