app/Models/UsersModel.php

SELECT *
FROM `users`
JOIN `roles` ON `roles`.`roles_id` = `users`.`roles_id`
---
  public function getAll(){
    $builder = $this->db->table('users');
    $builder->join('roles','roles.roles_id = users.roles_id');
    $query = $builder->get();